{
  "backend/main.mo": "Main actor for a Motoko backend managing candidates, gallery, news, and admin roles with blob storage, access control, and admission ID generation for an organization portal.",
  "backend/migration.mo": "Simple migration module that defines an Actor type with an admissionCounter field and passes state through unchanged.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, components, hooks, and configuration for a Hindi-language organization admission portal.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI element tokens.",
  "frontend/index.html": "HTML entry point for the frontend app titled 'करणी सेना युवा शक्ति' that mounts the React app at the root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admission form, admin panel, admin print card, and ID card reprint pages, wrapped in ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied screen displaying a Hindi message and a link back to the home page, shown when a non-admin user attempts to access a protected route.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component that lists all admission candidates in an accordion with photo, admission ID badge, and detailed fields like mobile, address, and qualification.",
  "frontend/src/components/AdminDeleteRecordsSection.tsx": "Admin section for searching and permanently deleting candidate records, with a confirmation dialog and toast notifications in Hindi.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin UI component for managing the photo gallery, allowing admins to add new images with descriptions and delete existing ones, with authorization checks and toast notifications.",
  "frontend/src/components/AdminManagementSection.tsx": "Admin UI section for managing the admin list, supporting adding/removing admins by principal ID and resetting the admin system, with confirmation dialogs and toast feedback.",
  "frontend/src/components/AdminNewsManager.tsx": "Admin UI component for creating, editing, and deleting news posts, with an inline form toggled by state and sorted display of existing news items.",
  "frontend/src/components/AdminPendingRequestsSection.tsx": "Displays pending candidate registration requests for admins, allowing approval (with redirect to print card) or rejection of each candidate.",
  "frontend/src/components/AdmissionCard.tsx": "Renders a printable ISO ID-card-sized admission card with candidate details and photo, styled with a saffron/gold theme and a print button.",
  "frontend/src/components/GallerySection.tsx": "Public-facing photo gallery section that fetches and displays gallery items in a responsive grid, with loading skeletons and an empty state message.",
  "frontend/src/components/ImageUploadField.tsx": "A reusable image upload form field component supporting drag-and-drop and file selection, with preview, upload progress, and 10MB size validation.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header, desktop and mobile navigation, and Internet Identity login/logout handling.",
  "frontend/src/components/NewsSection.tsx": "Displays a sorted grid of news items fetched from the backend, with loading skeletons and an empty state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name and create a profile if none exists.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that checks Internet Identity authentication and admin status, attempting super-admin initialization if needed, and shows an access denied screen otherwise.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook that calls the backend to add a new admin by principal string, then invalidates the admins query cache.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook that uploads an image blob with a description to the backend gallery, invalidating the gallery items cache on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook that creates a new news item (title, content, timestamp) via the backend and invalidates the news items cache.",
  "frontend/src/hooks/useDeleteCandidate.ts": "Mutation hook that deletes a candidate by admission ID from the backend and invalidates the candidates cache.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook that deletes a gallery item by description from the backend and invalidates the gallery items cache.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook that deletes a news item by title from the backend and invalidates the news items cache.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook that edits an existing news item's content and timestamp via the backend and invalidates the news items cache.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook that fetches the list of admins from the backend, enabled only when the actor and identity are available.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook that fetches all candidates from the backend, enabled only for authenticated users with a ready actor.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook that fetches all news items from the backend when the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile, returning null if none exists and exposing combined loading/fetched state.",
  "frontend/src/hooks/useGetCandidateByMobile.ts": "A React Query mutation hook that fetches a candidate by mobile number, normalizing the input to a 10-digit format before calling the backend.",
  "frontend/src/hooks/useGetCandidatesByStatus.ts": "A React Query hook that fetches all candidates filtered by a given status, requiring an authenticated identity and actor.",
  "frontend/src/hooks/useGetGalleryItems.ts": "A React Query hook that fetches all gallery items from the backend actor.",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "A mutation hook that calls the backend to initialize the super admin, then invalidates admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Computer authentication via AuthClient, exposing identity, login, clear, and status state.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "A React Query hook that checks whether the currently authenticated caller is an admin by querying the backend.",
  "frontend/src/hooks/useRemoveAdmin.ts": "A mutation hook that removes an admin by principal string, invalidating the admins query on success.",
  "frontend/src/hooks/useResetAdminSystem.ts": "A mutation hook that force-resets the admin system on the backend and invalidates admin-related queries on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "A mutation hook that saves the caller's user profile to the backend and invalidates the current user profile query on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "A mutation hook that submits an admission form to the backend, handling errors like duplicate mobile numbers and returning the generated admission ID on success.",
  "frontend/src/hooks/useUpdateCandidateStatus.ts": "A mutation hook that updates a candidate's status by admission ID and invalidates candidate-related queries on success.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a warm traditional OKLCH color palette for light and dark modes, and includes print styles for the admission ID card.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with a sidebar navigation that switches between sections for pending requests, candidates, gallery, news, admin management, and record deletion.",
  "frontend/src/pages/AdminPrintCardPage.tsx": "A page that looks up a candidate by admission ID and renders their AdmissionCard for printing, with a success banner and back navigation.",
  "frontend/src/pages/AdmissionFormPage.tsx": "React page component for a membership admission form with fields for name, father's name, DOB, mobile, qualification, address, and photo upload. Includes Hindi validation messages, field-level error handling, and duplicate mobile detection.",
  "frontend/src/pages/HomePage.tsx": "Landing page component featuring a hero section with logo and CTA buttons linking to the admission page, plus embedded GallerySection and NewsSection components.",
  "frontend/src/pages/ReprintIdCardPage.tsx": "Page that allows users to retrieve and reprint their admission ID card by searching with their registered 10-digit mobile number, displaying the AdmissionCard component on success.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, warm box-shadow utilities, and fade-in/accordion keyframe animations, using typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a bug-fix request (AR-1) to make admission serial numbers globally unique by sharing a single atomic counter across all members instead of per-year counters."
}