{
  "backend/main.mo": "Main Motoko actor for the application, implementing candidate admission management, gallery, news, and admin/super-admin role management with mobile number validation and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the mobile number validation in AdmissionFormPage.tsx was updated to accept exactly 10-digit Indian numbers with a Hindi error message, removing Pakistani format logic.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, page, hook, and style file's purpose and recent changes.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app with the title 'करणी सेना युवा शक्ति' and a root div that mounts the main.tsx module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admission, admin (protected), and reprint pages, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component with a Hindi heading, description, and a link button to return to the home page.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component that fetches and displays all admission candidates in an accordion list with photo, admission ID badge, and detailed fields per candidate.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin gallery management component that allows authenticated admins to add images with descriptions and delete existing gallery items, with authorization checks and error handling.",
  "frontend/src/components/AdminManagementSection.tsx": "React component for managing admins, allowing authenticated users to add/remove admins by principal ID and reset the admin system, with confirmation dialogs and toast notifications.",
  "frontend/src/components/AdminNewsManager.tsx": "React component for admin CRUD operations on news posts, featuring a form for creating/editing news items and a list with delete confirmation dialogs.",
  "frontend/src/components/AdmissionCard.tsx": "Renders a printable ISO ID-card-sized admission card with a saffron/gold theme displaying applicant details (name, photo, DOB, etc.) and a print button.",
  "frontend/src/components/GallerySection.tsx": "Displays a responsive photo gallery grid fetched from the backend, with loading skeletons and an empty-state message in Hindi.",
  "frontend/src/components/ImageUploadField.tsx": "A reusable image upload field supporting drag-and-drop and file selection, with preview, upload progress, and removal functionality using the ExternalBlob type.",
  "frontend/src/components/Layout.tsx": "Main application layout with a sticky header, desktop and mobile navigation links, and Internet Identity login/logout handling using TanStack Router.",
  "frontend/src/components/NewsSection.tsx": "Displays a sorted list of news items in a responsive card grid with loading skeletons and an empty state, fetched via useGetAllNewsItems hook.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, then saves it via useSaveCallerUserProfile; cannot be dismissed until completed.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that checks authentication and admin status, attempts super admin initialization if needed, and renders an AccessDeniedScreen or a loading spinner otherwise.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor (authenticated or anonymous) using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook that calls the backend addAdmin method with a Principal and invalidates the admins query on success.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook that uploads a gallery image with a description to the backend and invalidates the galleryItems query on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook that creates a new news item (title, content, createdAt) on the backend and invalidates the newsItems query on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook that deletes a gallery item by description and invalidates the galleryItems query on success.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook that deletes a news item by title and invalidates the newsItems query on success.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook that edits an existing news item's content and timestamp and invalidates the newsItems query on success.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook that fetches the list of admins from the backend, enabled only when the actor and identity are available.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook that fetches all candidates from the backend, enabled only when authenticated with a valid actor.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook that fetches all news items from the backend whenever the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current caller's user profile, exposing combined loading state that accounts for actor initialization.",
  "frontend/src/hooks/useGetCandidateByMobile.ts": "Mutation hook that looks up a candidate by mobile number and returns the result or null.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Query hook that fetches all gallery items from the backend when the actor is available.",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "Mutation hook that calls initializeSuperAdmin on the backend and invalidates admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, login/logout, and expose identity and login status to the component tree.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Query hook that checks whether the current caller is an admin, enabled only when authenticated with a valid actor.",
  "frontend/src/hooks/useRemoveAdmin.ts": "Mutation hook that removes an admin by Principal and invalidates the admins query on success.",
  "frontend/src/hooks/useResetAdminSystem.ts": "Mutation hook that force-resets the admin system on the backend and invalidates both admins and isCallerAdmin queries.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook that saves the caller's user profile to the backend and invalidates the currentUserProfile query on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "React Query mutation hook that submits an admission form to the backend actor, handles mobile-already-registered errors, and returns a generated temporary admission ID on success.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, defines a warm traditional OKLCH color palette for light/dark modes, and includes print styles for rendering an admission ID card at credit-card dimensions.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with a sidebar navigation that switches between four sections: Admission Applications, Photo Gallery, News & Updates, and Manage Admins.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission form page with client-side validation (including Indian mobile number format), photo upload, and displays an AdmissionCard on successful submission.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section with a call-to-action for admission, followed by Gallery and News sections.",
  "frontend/src/pages/ReprintIdCardPage.tsx": "Page that lets users search for their admission record by mobile number and reprint their ID card if found.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them in sessionStorage, and clean sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, box shadows, keyframe animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Aavedan Form project, recording existing features, pending fix requests, and architectural notes—primarily focused on fixing mobile number validation to accept 10-digit Indian format with Hindi error messages."
}