{
  "backend/main.mo": "Main Motoko actor for the backend, implementing candidate admissions, gallery, news, and admin management with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Apply for Admission' CTA button in HomePage.tsx was updated to emerald green to visually distinguish it from the saffron/gold/deep-red theme.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing their purpose, Hindi translations, and key UI/logic responsibilities.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes used throughout the frontend.",
  "frontend/index.html": "HTML entry point for the frontend app, setting the page title to 'करणी सेना युवा शक्ति' and mounting the React app at the #root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admission, and admin pages, along with ThemeProvider, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied screen displaying a Hindi heading and message with a link back to the home page.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component that lists all admission candidates in an accordion layout, showing admission ID badges, photos, and detailed candidate info fields.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin interface for managing the photo gallery, including adding new images with descriptions and deleting existing ones, with admin authorization checks and error handling.",
  "frontend/src/components/AdminManagementSection.tsx": "React component for managing admins, allowing authenticated users to add/remove admins by principal ID and reset the admin system, with confirmation dialogs and toast notifications.",
  "frontend/src/components/AdminNewsManager.tsx": "React component for admin CRUD operations on news posts, featuring a form for creating/editing news items and a list with delete confirmation dialogs.",
  "frontend/src/components/AdmissionCard.tsx": "Renders a printable ISO ID-card-sized admission card with a saffron/gold theme displaying applicant details (name, photo, DOB, etc.) and a print button.",
  "frontend/src/components/GallerySection.tsx": "Displays a responsive photo gallery grid fetched from the backend, with loading skeletons and an empty-state message in Hindi.",
  "frontend/src/components/ImageUploadField.tsx": "Reusable image upload field supporting drag-and-drop and file selection, with preview, upload progress, and removal functionality using ExternalBlob.",
  "frontend/src/components/Layout.tsx": "App shell layout with a sticky header, desktop and mobile navigation, and Internet Identity login/logout handling using TanStack Router.",
  "frontend/src/components/NewsSection.tsx": "Displays a grid of news items fetched via `useGetAllNewsItems`, sorted by date, with loading skeletons and an empty state using a Newspaper icon.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal dialog prompting authenticated users without a profile to enter their name, then saves it via `useSaveCallerUserProfile`.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards admin routes by checking authentication and admin status, attempting super admin initialization if needed, and rendering an access denied screen otherwise.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook that calls `actor.addAdmin` with a Principal parsed from a string and invalidates the admins query on success.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook that uploads a gallery image with a description via `actor.addGalleryItem` and invalidates the gallery items query on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook that creates a news item with title, content, and timestamp via `actor.createNewsItem` and invalidates the news items query on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook that deletes a gallery item by description via `actor.deleteGalleryItem` and invalidates the gallery items query on success.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook that deletes a news item by title via `actor.deleteNewsItem` and invalidates the news items query on success.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook that edits an existing news item's content and timestamp via `actor.editNewsItem` and invalidates the news items query on success.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook that fetches the list of admins via `actor.getAdmins`, enabled only when the actor and identity are available.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook that fetches all admission candidates via `actor.getAllCandidates`, enabled only for authenticated users with an available actor.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook that fetches all news items via `actor.getAllNewsItems`, enabled when the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current caller's user profile via `actor.getCallerUserProfile`, returning null if none exists and exposing combined loading/fetched state.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Query hook that fetches all gallery items via `actor.getGalleryItems`, enabled when the actor is ready.",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "Mutation hook that calls `actor.initializeSuperAdmin` and invalidates admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage ICP Internet Identity authentication state, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Query hook that checks whether the current caller is an admin via `actor.isCallerAdmin`, enabled only for authenticated users.",
  "frontend/src/hooks/useRemoveAdmin.ts": "Mutation hook that removes an admin by Principal via `actor.removeAdmin` and invalidates the admins query on success.",
  "frontend/src/hooks/useResetAdminSystem.ts": "Mutation hook that force-resets the admin system via `actor.resetAdminSystemForce` and invalidates admin-related queries on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook that saves the caller's user profile via `actor.saveCallerUserProfile` and invalidates the current user profile query on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "Mutation hook that submits an admission form anonymously via `actor.submitAdmissionForm`, generates a temporary admission ID client-side, and invalidates the candidates query on success.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a warm traditional OKLCH color palette (saffron, deep red, gold) for light and dark modes, and includes print styles for an admission ID card.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with a sidebar navigation that switches between four sections: Admission Applications, Photo Gallery, News & Updates, and Manage Admins.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission form page that collects applicant details and a photo, submits them via a mutation hook, and displays a printable AdmissionCard on successful submission.",
  "frontend/src/pages/HomePage.tsx": "Home page with a hero section featuring the organization's branding and a call-to-action for admission, followed by Gallery and News sections.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them in sessionStorage, and clean sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends theme with custom shadows, border radii, and animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 25) for the Karani Sena Yuva Shakti website, including architectural notes, known issues, and a list of existing features covering home page, admission form, admin panel, gallery, news, and authentication."
}