{
  "backend/main.mo": "Main Motoko actor for the ICP backend implementing candidate admissions, gallery, news, and admin management with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report linking the useGetCandidateByMobile hook and ReprintIdCardPage files to the requirement of normalizing mobile numbers and displaying Hindi error messages on no match.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing their purpose, UI language (Hindi), and key behaviors for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH color tokens for light and dark themes used across the application.",
  "frontend/index.html": "HTML entry point for the React app with the title 'करणी सेना युवा शक्ति' and a root div for mounting.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admission, admin (protected), and reprint pages, wrapped in ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page Hindi access denied screen with a shield icon, descriptive message, and a home navigation button.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component that lists all admission candidates in an accordion with admission ID badges, candidate details, and photo display.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin gallery management component with authorization checks, image upload, description input, and delete functionality with toast notifications.",
  "frontend/src/components/AdminManagementSection.tsx": "React component for managing admins, allowing authenticated users to add/remove admins by principal ID and reset the admin system, with confirmation dialogs and toast notifications.",
  "frontend/src/components/AdminNewsManager.tsx": "React component for admin CRUD operations on news posts, featuring a form for creating/editing news items and a list with delete confirmation dialogs.",
  "frontend/src/components/AdmissionCard.tsx": "Renders a printable ISO ID-card-sized admission card with a saffron/gold theme displaying applicant details (name, photo, DOB, etc.) and a print button.",
  "frontend/src/components/GallerySection.tsx": "Displays a responsive photo gallery grid fetched from the backend, with loading skeletons and an empty-state message in Hindi.",
  "frontend/src/components/ImageUploadField.tsx": "A reusable image upload field supporting drag-and-drop and file selection, with preview, upload progress, and removal functionality using the ExternalBlob type.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with desktop and mobile navigation, Internet Identity login/logout, and an Outlet for nested routes.",
  "frontend/src/components/NewsSection.tsx": "Renders a news section displaying all news items sorted by date, with loading skeletons and an empty state using a Newspaper icon.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal dialog prompting authenticated users without a profile to enter their name, then saves it via the saveCallerUserProfile mutation.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards admin-only routes by checking authentication and admin status, attempting super admin initialization if needed, and showing an access denied screen otherwise.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor instance (anonymous or authenticated) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook that calls the backend addAdmin method with a Principal and invalidates the admins query on success.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook that uploads a gallery item (image blob and description) to the backend and invalidates the galleryItems query on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook that creates a new news item with title, content, and timestamp via the backend actor, invalidating the newsItems query on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook that deletes a gallery item by description and invalidates the galleryItems query on success.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook that deletes a news item by title and invalidates the newsItems query on success.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook that edits an existing news item's content and timestamp by title, invalidating the newsItems query on success.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook that fetches the list of admins from the backend, enabled only when the actor and identity are available.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook that fetches all candidates from the backend, enabled only for authenticated users with an available actor.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook that fetches all news items from the backend actor, enabled when the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current caller's user profile, returning null if none exists and exposing combined loading/fetched state.",
  "frontend/src/hooks/useGetCandidateByMobile.ts": "Mutation hook that looks up a candidate by mobile number (with normalization for Indian formats) and surfaces authorization errors distinctly.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Query hook that fetches all gallery items from the backend actor when it is available.",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "Mutation hook that calls initializeSuperAdmin on the backend and invalidates admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage Internet Identity authentication state, login, and logout using AuthClient.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Query hook that checks whether the current caller is an admin, enabled only when authenticated with an available actor.",
  "frontend/src/hooks/useRemoveAdmin.ts": "Mutation hook that removes an admin by Principal and invalidates the admins query on success.",
  "frontend/src/hooks/useResetAdminSystem.ts": "Mutation hook that force-resets the admin system via the backend and invalidates both admins and isCallerAdmin queries on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook that saves the caller's user profile to the backend and invalidates the currentUserProfile query on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "React Query mutation hook that submits an admission form to the backend actor, handles errors like duplicate mobile registration, and invalidates the candidates query on success.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a warm traditional OKLCH color palette for light/dark modes, and includes print styles for credit-card-sized admission ID card printing.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with a sidebar navigation that switches between four sections: admission applications, photo gallery, news management, and admin management.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission form page with client-side validation for fields like name, mobile, and address, photo upload support, and displays an AdmissionCard on successful submission or duplicate mobile detection.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section with a call-to-action for admission, followed by gallery and news sections.",
  "frontend/src/pages/ReprintIdCardPage.tsx": "Page that allows users to search for their admission record by mobile number and reprint their ID card, handling not-found and error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, box shadows, keyframe animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Karni Sena Yuva Shakti candidate registration portal project, documenting known bugs (mobile number search returning no results), architectural notes, existing features, and two pending fix requests (AR-1, AR-2) related to candidate lookup and mobile number normalization."
}