{
  "backend/main.mo": "Main Motoko actor for the application managing candidates, gallery, news, user profiles, and admin roles with access control, blob storage mixins, and mobile number validation.",
  "backend/migration.mo": "Migration module that converts old actor state (with Nat createdAt fields) to new actor state (with Int createdAt fields) for candidates and news items.",
  "feature_evidence.json": "Feature evidence report confirming that frontend-side admission ID generation has been removed and the displayed ID now comes directly from the backend response.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files describing their purpose, UI language (Hindi), and key behaviors.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point for the React app with the title 'करणी सेना युवा शक्ति' and a root div that loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admission, admin (protected), and reprint pages, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component with a Hindi heading, description, and a link button to return to the home page.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component that lists all admission candidates in an accordion with photo, admission ID badge, and detailed fields including father's name and qualification.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin UI component for managing the photo gallery, allowing admins to add new images with descriptions and delete existing ones, with authorization checks and toast notifications.",
  "frontend/src/components/AdminManagementSection.tsx": "Admin UI section for managing the admin list, supporting adding/removing admins by principal ID and resetting the admin system, with confirmation dialogs and toast feedback.",
  "frontend/src/components/AdminNewsManager.tsx": "Admin UI component for creating, editing, and deleting news posts, with an inline form toggled by state and sorted display of existing news items.",
  "frontend/src/components/AdmissionCard.tsx": "Renders a printable ISO ID-card-sized admission card with applicant details (name, father's name, DOB, mobile, photo) styled in a saffron/gold theme, plus a print button.",
  "frontend/src/components/GallerySection.tsx": "Public-facing gallery section that fetches and displays gallery images in a responsive grid, with loading skeletons and an empty-state message.",
  "frontend/src/components/ImageUploadField.tsx": "Reusable image upload field supporting click-to-upload and drag-and-drop, with preview, upload progress indicator, and removal functionality using the ExternalBlob type.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, desktop and mobile navigation, and Internet Identity login/logout handling using TanStack Router.",
  "frontend/src/components/NewsSection.tsx": "Displays a sorted grid of news items fetched from the backend, with loading skeletons and an empty state fallback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name and create a profile if none exists yet.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that checks Internet Identity authentication and admin status, auto-initializing the super admin if needed, and shows an access denied screen otherwise.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook that calls the backend to add a new admin by principal string and invalidates the admins query on success.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook that uploads a gallery image with description to the backend and invalidates the gallery items query on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook that creates a new news item with title, content, and timestamp via the backend actor, invalidating the news items query on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook that deletes a gallery item by description and invalidates the gallery items query on success.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook that deletes a news item by title and invalidates the news items query on success.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook that edits an existing news item's content and timestamp and invalidates the news items query on success.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook that fetches the list of admins from the backend, enabled only when the actor is ready and the user is authenticated.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook that fetches all candidates from the backend, enabled only for authenticated users with a ready actor.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook that fetches all news items from the backend actor, enabled when the actor is available.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile, returning null if none exists and combining actor loading state.",
  "frontend/src/hooks/useGetCandidateByMobile.ts": "Mutation hook that looks up a candidate by mobile number from the backend, returning the candidate or null.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Query hook that fetches all gallery items from the backend actor when it is ready.",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "Mutation hook that calls the backend to initialize the super admin and invalidates admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks whether the currently authenticated caller is an admin by calling the backend actor's `isCallerAdmin` method.",
  "frontend/src/hooks/useRemoveAdmin.ts": "React Query mutation hook that removes an admin by principal string, invalidating the admins query cache on success.",
  "frontend/src/hooks/useResetAdminSystem.ts": "React Query mutation hook that force-resets the admin system via the backend actor, invalidating both admins and isCallerAdmin queries on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the caller's user profile to the backend and invalidates the currentUserProfile query cache on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "React Query mutation hook that submits an admission form to the backend, handling errors like duplicate mobile registration and invalid mobile numbers with a custom error class.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind CSS layers, a warm OKLCH-based color palette with light/dark mode variables, utility animations, and print styles for an admission ID card.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with a sidebar navigation that switches between four sections: admission candidates, photo gallery, news management, and admin management.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission form page with client-side validation for fields like name, mobile, and address, photo upload support, and displays an admission card upon successful submission.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section with organization branding and CTA buttons, followed by gallery and news sections.",
  "frontend/src/pages/ReprintIdCardPage.tsx": "A React page that allows candidates to retrieve and reprint their admission ID card by searching with their registered mobile number, displaying the AdmissionCard component on success or an error alert on failure.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors, border radii, box shadows, and animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the Karni Sena Yuva Shakti admission portal, documenting a known bug where candidates see a frontend-generated temporary ID instead of the canonical backend ID after first form submission, along with pending fix requests for consistent ID display and duplicate mobile number prevention."
}