{
  "backend/main.mo": "Main Motoko actor for the ICP backend implementing user profiles, candidate admissions, gallery, news, and admin/super-admin management with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming the replacement of the home page hero logo with the circular करणी सेना युवा शक्ति emblem image saved as a static asset and rendered in HomePage.tsx.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and key details of each component, page, hook, and configuration file in the project.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens including sidebar, chart, and destructive variants.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'करणी सेना युवा शक्ति' in Devanagari script and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, admission, and protected admin pages, wrapping the app in ThemeProvider and rendering a global Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component displaying a shield alert icon, explanatory message, and a button to return to the home page.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component that fetches and displays all admission candidates in an accordion list with photo, admission ID badge, and detailed fields including father's name and qualification.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin gallery management component that handles adding and deleting gallery photos with admin authorization checks, loading states, and descriptive error toasts for unauthorized actions.",
  "frontend/src/components/AdminManagementSection.tsx": "React component for managing admins, allowing authenticated users to add/remove admins and reset the admin system via form inputs and confirmation dialogs.",
  "frontend/src/components/AdminNewsManager.tsx": "React component for admins to create, edit, and delete news posts, with a form toggled by state and a sorted list of existing news items.",
  "frontend/src/components/AdmissionCard.tsx": "Displays a printable admission card with applicant details (name, DOB, photo, etc.) and a print button, styled for both screen and print media.",
  "frontend/src/components/GallerySection.tsx": "Renders a photo gallery section by fetching gallery items from a hook, showing skeletons while loading and an empty state if no images exist.",
  "frontend/src/components/ImageUploadField.tsx": "A reusable image upload field supporting drag-and-drop and file selection, with preview, upload progress, and removal functionality using ExternalBlob.",
  "frontend/src/components/Layout.tsx": "App shell layout component with a sticky header, responsive navigation links, and Internet Identity login/logout handling for both desktop and mobile.",
  "frontend/src/components/NewsSection.tsx": "Displays a grid of news items fetched via `useGetAllNewsItems`, sorted by date descending, with loading skeletons and an empty state fallback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal dialog prompting authenticated users without a profile to enter their name, then saves it via `useSaveCallerUserProfile`.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards admin routes by checking authentication and admin status, attempting super-admin initialization if needed, and rendering `AccessDeniedScreen` when access is not granted.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook that calls `actor.addAdmin` with a principal string and invalidates the `admins` query on success.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook that uploads an image and description to the backend via `actor.addGalleryItem` and invalidates the `galleryItems` query on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook that creates a news item with title, content, and timestamp via `actor.createNewsItem`, invalidating `newsItems` on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook that deletes a gallery item by description via `actor.deleteGalleryItem` and invalidates the `galleryItems` query.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook that deletes a news item by title via `actor.deleteNewsItem` and invalidates the `newsItems` query.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook that edits an existing news item's content and timestamp via `actor.editNewsItem`, invalidating `newsItems` on success.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook that fetches the list of admins via `actor.getAdmins`, enabled only when the actor and identity are available.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook that fetches all candidates via `actor.getAllCandidates`, enabled only for authenticated users with a ready actor.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook that fetches all news items via `actor.getAllNewsItems`, enabled when the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current caller's user profile via `actor.getCallerUserProfile`, exposing combined loading and fetched states.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Query hook that fetches all gallery items via `actor.getGalleryItems`, enabled when the actor is ready.",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "Mutation hook that calls `actor.initializeSuperAdmin` and invalidates admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP Internet Identity authentication state, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Query hook that checks whether the current caller is an admin via `actor.isCallerAdmin`, enabled only for authenticated users.",
  "frontend/src/hooks/useRemoveAdmin.ts": "Mutation hook that removes an admin by principal string via `actor.removeAdmin` and invalidates the `admins` query.",
  "frontend/src/hooks/useResetAdminSystem.ts": "Mutation hook that force-resets the admin system via `actor.resetAdminSystemForce` and invalidates admin-related queries.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook that saves the caller's user profile via `actor.saveCallerUserProfile` and invalidates the `currentUserProfile` query.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "Mutation hook that submits an admission form anonymously via `actor.submitAdmissionForm`, returns a client-generated placeholder admission ID, and invalidates the `candidates` query.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a warm traditional OKLCH color palette (saffron, deep red, gold) for light and dark modes, and includes print styles for the admission card.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with a sidebar navigation that switches between four sections: Admission Applications, Photo Gallery, News & Updates, and Manage Admins.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission form page that collects applicant details and a photo, submits them via a mutation hook, and displays a printable AdmissionCard on success.",
  "frontend/src/pages/HomePage.tsx": "Home page with a hero section featuring the organization logo and call-to-action buttons, followed by Gallery and News sections.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them in sessionStorage, and clean sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and box shadow, adds fade-in and accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 19) for the Karani Sena Yuva Shakti website, including architectural notes, known issues, existing features, and image requirements for a home page, admission form, and Internet Identity-protected admin panel."
}