{
  "kind": "build_request",
  "title": "Fix admission ID format inconsistency on first form submission",
  "projectName": "Karni Sena Yuva Shakti",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a candidate submits the admission form for the first time, the backend must return the stored admission ID in the Admin portal format (e.g., 2023000008 — a sequential numeric ID) immediately upon form submission, not a temporary frontend-generated ID like '20260-34913'. The ID shown on the AdmissionCard right after first submission must be identical to the ID stored in the backend and visible in the Admin portal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Admin portal wala",
          "candidate ke form submit karne ke baad hi hota hai agar vah id punah prapat kare toh admin portal ke saman aati hai"
        ]
      },
      "acceptanceCriteria": [
        "After first form submission, the AdmissionCard displays the same numeric ID format (e.g., 2023000008) that appears in the Admin portal for that candidate.",
        "The backend submitAdmissionForm function returns the persistent sequential numeric admission ID, not any temporary frontend-generated ID.",
        "Re-retrieving the same candidate by mobile number returns the exact same ID that was shown immediately after first submission."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove or stop using any frontend-side temporary admission ID generation logic in useSubmitAdmissionForm.ts or AdmissionFormPage.tsx. The admission ID displayed after submission must come directly from the backend response, not be generated on the frontend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "Form submit hone par candidate portal apna alag ID format generate kar raha hai"
        ]
      },
      "acceptanceCriteria": [
        "No temporary ID (e.g., '20260-XXXXX' format) is ever generated or displayed on the frontend.",
        "The AdmissionCard component receives and displays the admission ID returned directly from the backend after form submission.",
        "The useSubmitAdmissionForm hook uses the backend-returned ID value exclusively."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure duplicate mobile number registration is prevented: before creating a new admission record, the backend must check if a candidate with the same mobile number already exists. If they do, return the existing candidate's admission ID instead of creating a new record.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "mobile number se check hota hai ki vah vyakti pehle se registered hai ya nahi"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the admission form with an already-registered mobile number does not create a duplicate record.",
        "When a duplicate mobile is detected, the backend returns the existing candidate's admission ID.",
        "The frontend correctly handles and displays the existing ID when a duplicate mobile submission occurs."
      ]
    }
  ],
  "constraints": [
    "Do not change the admission ID format currently used in the Admin portal (sequential numeric format like 2023000008).",
    "Do not alter any immutable frontend paths listed in the system context."
  ],
  "nonGoals": [
    "Changing the visual design of the AdmissionCard.",
    "Adding new form fields to the admission form.",
    "Modifying the Admin portal's candidate management UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}