{
  "kind": "build_request",
  "title": "Fix duplicate serial number bug in member registration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the serial number (admission ID) generation logic in the backend so that every member receives a globally unique serial number. The current bug allows two members to share the same numeric suffix (e.g., Kunwar Akhand Pratap Singh has 2023000004 and Sonu Singh has 2024000004 — both ending in 000004). The new logic must ensure the sequential counter is shared across all members regardless of year prefix, so no two members ever get the same trailing numeric part. The counter must be stored as a single stable value in the actor state and incremented atomically on each new registration.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Last ka serial no. Double ho ja raha hai",
          "Kunwar Akhand Pratap Singh को 2023000004 और Sonu Singh को 2024000004 serial number मिला है — दोनों का last part 000004 same है, यही duplicate bug है"
        ]
      },
      "acceptanceCriteria": [
        "No two members in the system share the same numeric suffix in their serial number.",
        "Each new member registration increments a single global counter and uses it as the serial number suffix.",
        "Existing members with serial numbers 2023000004 and 2024000004 (or any other duplicates) are detected and the counter is initialized to a value higher than the highest existing suffix to prevent future collisions.",
        "Serial number format continues to follow the pattern YYYYxxxxxx (year prefix + zero-padded global counter).",
        "Concurrent registrations do not produce duplicate serial numbers."
      ]
    }
  ],
  "constraints": [
    "Do not change the serial number display format (YYYY + 6-digit zero-padded counter).",
    "Existing member records must not be deleted or have their serial numbers changed automatically — only the counter initialization logic should account for them.",
    "All backend logic must remain in the single main actor (backend/main.mo)."
  ],
  "nonGoals": [
    "Retroactively renumbering or reassigning serial numbers to existing members.",
    "Changing any frontend UI components or layouts.",
    "Adding new features unrelated to serial number uniqueness."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}