{
  "kind": "build_request",
  "title": "Highlight 'प्रवेश के लिए आवेदन करें' button with a distinct contrasting color",
  "projectName": "करणी सेना युवा शक्ति",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "In the home page hero section (HomePage.tsx), update the 'प्रवेश के लिए आवेदन करें' (Apply for Admission) call-to-action button to use a distinct, visually contrasting highlight color that makes it stand out prominently from the other buttons and the hero background. The highlight color should complement but contrast clearly with the existing saffron/gold/deep-red theme — for example, a bright emerald green, royal blue, or vibrant accent not currently used on the page. Ensure the button retains readable text, appropriate hover/focus states, and remains visually consistent with the overall warm traditional design language.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "\"Pravesh ke liye aavedan kare\" ko highlight karo kisi dusre color me"
        ]
      },
      "acceptanceCriteria": [
        "The 'प्रवेश के लिए आवेदन करें' button on the home page hero section renders in a distinct highlight color that is clearly different from the saffron/gold/deep-red palette used by other elements.",
        "The button color contrasts visually with the hero section background and surrounding buttons, making it the most prominent CTA on the page.",
        "The button has a visible hover/focus state that complements the chosen highlight color.",
        "Button text remains fully legible against the new background color.",
        "All other buttons and UI elements on the home page retain their existing styling unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths.",
    "Only the 'प्रवेश के लिए आवेदन करें' button color should change; do not alter other buttons or hero section layout.",
    "The new color must not conflict with or duplicate existing saffron, deep red, or gold brand colors already used on the page."
  ],
  "nonGoals": [
    "Changing any other buttons or CTA elements on the home page.",
    "Modifying the admin panel styling.",
    "Altering the overall color theme or brand palette of the website.",
    "Changes to the admission form page or any other page."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}