{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admission ID format inconsistency on first form submission",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Remove frontend-side temporary admission ID generation and display backend-returned admission ID directly",
      "acceptanceCriteria": [
        "No temporary ID (e.g., '20260-XXXXX' format) is ever generated or displayed on the frontend.",
        "The AdmissionCard component receives and displays the admission ID returned directly from the backend after form submission.",
        "The useSubmitAdmissionForm hook uses the backend-returned ID value exclusively."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSubmitAdmissionForm.ts",
          "operation": "modify",
          "description": "Remove all temporary admission ID generation logic. The mutation function must return only the admission ID received directly from the backend response (result.ok when result.__kind__ === 'ok'). Do not generate any frontend-side IDs like '20260-34913'. Ensure the returned admissionId matches the backend format (e.g., '2023000008')."
        },
        {
          "path": "frontend/src/pages/AdmissionFormPage.tsx",
          "operation": "modify",
          "description": "Update the form submission success handler to use the admission ID returned by the useSubmitAdmissionForm mutation directly. Remove any logic that generates or transforms the admission ID on the frontend. Pass the backend-returned ID to the AdmissionCard component without modification. Handle the mobileAlreadyRegistered error case by displaying the existing admission ID returned in the error payload."
        },
        {
          "path": "frontend/src/components/AdmissionCard.tsx",
          "operation": "modify",
          "description": "Ensure the AdmissionCard component displays the admissionID prop exactly as received, without any frontend-side formatting or transformation. The displayed ID must match the backend format (e.g., '2023000008') visible in the Admin portal."
        }
      ]
    }
  ]
}