{
  "backend/main.mo": "Main actor implementing admission management system with user profiles, candidate records (including fatherName and admissionID fields), gallery, news, and admin role management with super admin initialization and access control.",
  "backend/migration.mo": "Migration module that transforms old candidate records (keyed by Principal) to new format (keyed by Text) and adds fatherName and admissionID fields with empty default values.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: father's name field in admission form, printable admission card with unique ID, and admission ID display in admin panel.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the admission management system with warm traditional styling.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color variables for light/dark themes using warm traditional palette, plus print media query optimizations for admission card printing.",
  "frontend/index.html": "HTML entry point for 'Karani Sena Yuva Shakti Website' with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, admission form, and protected admin panel, wrapped in ThemeProvider with ProfileSetupModal and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component with shield icon and return-to-home button for unauthorized admin access attempts.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component displaying candidate submissions in accordion format with prominent admission ID badges, photos, and detailed information including father's name field.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin component for managing gallery items with add/delete functionality, image upload, and authorization checks. Displays gallery items in a grid with delete confirmation dialogs and handles admin-only access control.",
  "frontend/src/components/AdminManagementSection.tsx": "Admin management interface for adding/removing admins by principal ID and resetting the admin system. Displays current admin list with badges and provides alert dialogs for destructive actions.",
  "frontend/src/components/AdminNewsManager.tsx": "Admin component for creating, editing, and deleting news items with a form interface. Displays news items sorted by creation date with edit/delete actions and confirmation dialogs.",
  "frontend/src/components/AdmissionCard.tsx": "Displays a printable admission card with student details, photo, and admission ID. Includes print functionality and formatted layout optimized for both screen and print media.",
  "frontend/src/components/GallerySection.tsx": "Public-facing gallery section that displays photo grid with descriptions. Shows loading skeletons and empty state when no photos are available.",
  "frontend/src/components/ImageUploadField.tsx": "Reusable image upload component with drag-and-drop support, preview, progress tracking, and file validation. Converts uploaded files to ExternalBlob format with size and type restrictions.",
  "frontend/src/components/Layout.tsx": "Main layout component with responsive navigation header, mobile menu toggle, and authentication controls (login/logout) using Internet Identity. Includes links to Home, Admission Form, and Admin pages with conditional rendering based on auth state.",
  "frontend/src/components/NewsSection.tsx": "Displays a grid of news items sorted by creation date, with loading skeletons and empty state handling. Fetches news data using useGetAllNewsItems hook and renders cards with title, date, and content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Appears automatically after login and saves the profile using useSaveCallerUserProfile hook.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin status, automatically initializes super admin if needed, and shows access denied screen for unauthorized users. Displays loading spinner during checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries. Handles both authenticated and anonymous actors.",
  "frontend/src/hooks/useAddAdmin.ts": "Mutation hook to add a new admin by principal ID, invalidating the admins query cache on success.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Mutation hook to add a gallery item with image blob and description, with error handling and cache invalidation.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Mutation hook to create a news item with title, content, and timestamp, invalidating news items cache on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Mutation hook to delete a gallery item by description, invalidating gallery items cache on success.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Mutation hook to delete a news item by title, invalidating news items cache on success.",
  "frontend/src/hooks/useEditNewsItem.ts": "Mutation hook to edit an existing news item's content and timestamp, invalidating news items cache on success.",
  "frontend/src/hooks/useGetAdmins.ts": "Query hook to fetch list of admin users, enabled only when actor is ready and user is authenticated.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Query hook to fetch all admission candidates, enabled only when actor is ready and user is authenticated.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Query hook to fetch all news items, enabled when actor is ready (no authentication required).",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook to fetch the current authenticated user's profile, returning null if no profile exists. Includes custom loading state handling.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Query hook to fetch all gallery items, enabled when actor is ready (no authentication required).",
  "frontend/src/hooks/useInitializeSuperAdmin.ts": "Mutation hook to initialize the first super admin, invalidating admin-related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current authenticated user is an admin by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useRemoveAdmin.ts": "React Query mutation hook for removing an admin by principal, invalidating the admins query cache on success.",
  "frontend/src/hooks/useResetAdminSystem.ts": "React Query mutation hook that forcefully resets the admin system and invalidates both admins and isCallerAdmin query caches.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile, invalidating the currentUserProfile query cache on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "React Query mutation hook that submits an admission form with candidate details and photo, then retrieves and returns the newly created admission ID.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette (saffron, red, gold theme), dark mode support, fade-in animations, and print styles for admission cards.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with sidebar navigation for managing admission applications, photo gallery, news updates, and administrator accounts.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission form page that collects candidate information and photo, submits to backend, and displays a printable admission card upon successful submission.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section featuring organization branding, call-to-action buttons for admission, and sections for gallery and news content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container queries, typography plugin, custom animations (accordion, fade-in), and warm shadow utilities.",
  "project_state.json": "Project state document describing a Karani Sena Yuva Shakti organization website with public admission forms, Internet Identity-protected admin panel with sidebar navigation, photo gallery, news management, and multi-admin role-based access control."
}