{
  "backend/main.mo": "Main backend actor implementing user profiles, admission form submissions, photo gallery, and news management with role-based access control (admin/user permissions) and blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (home page, gallery, news, admission form, admin panel) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including pages, components, hooks, and configuration files for the organization website application.",
  "frontend/index.css": "Global CSS with Tailwind directives defining warm traditional color palette (saffron, deep red, gold) using OKLCH color system for light and dark modes.",
  "frontend/index.html": "HTML entry point for the Karani Sena Yuva Shakti website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, admission form, and protected admin panel, plus ThemeProvider, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component with shield icon and return-to-home button for unauthorized admin panel access attempts.",
  "frontend/src/components/AdminCandidatesList.tsx": "Admin component displaying admission applications in an accordion list with candidate photos, contact details, qualifications, and addresses.",
  "frontend/src/components/AdminGalleryManager.tsx": "Admin component for managing gallery photos with add/delete functionality, image upload, description input, and grid display of current gallery items with delete confirmation dialogs.",
  "frontend/src/components/AdminNewsManager.tsx": "Admin component for CRUD operations on news items, featuring a form for creating/editing posts with title and content fields, and a list view with edit/delete actions.",
  "frontend/src/components/GallerySection.tsx": "Public-facing gallery section that displays photo grid with descriptions, handles loading states with skeletons, and shows empty state when no photos exist.",
  "frontend/src/components/ImageUploadField.tsx": "Reusable image upload component with drag-and-drop support, file validation (10MB limit), preview display, upload progress tracking, and ExternalBlob integration.",
  "frontend/src/components/Layout.tsx": "Main layout component with responsive navigation, Internet Identity authentication, admin role detection, and mobile menu toggle functionality.",
  "frontend/src/components/NewsSection.tsx": "Public news section displaying sorted news items in a card grid, with loading skeletons and empty state handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without profiles to enter their name, blocking interaction until profile setup is complete.",
  "frontend/src/components/ProtectedRoute.tsx": "A React component that protects routes by checking if the user is authenticated and has admin privileges, showing a loader during checks and an access denied screen if unauthorized.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an actor instance for backend communication, handling authentication with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAddGalleryItem.ts": "Custom hook that provides a mutation for adding gallery items with an image and description, invalidating the gallery items query cache on success.",
  "frontend/src/hooks/useCreateNewsItem.ts": "Custom hook that provides a mutation for creating news items with title, content, and timestamp, invalidating the news items query cache on success.",
  "frontend/src/hooks/useDeleteGalleryItem.ts": "Custom hook that provides a mutation for deleting gallery items by description, invalidating the gallery items query cache on success.",
  "frontend/src/hooks/useDeleteNewsItem.ts": "Custom hook that provides a mutation for deleting news items by title, invalidating the news items query cache on success.",
  "frontend/src/hooks/useEditNewsItem.ts": "Custom hook that provides a mutation for editing news items with updated title, content, and timestamp, invalidating the news items query cache on success.",
  "frontend/src/hooks/useGetAllCandidates.ts": "Custom hook that fetches all admission form candidates from the backend, enabled only when the actor is ready and user is authenticated.",
  "frontend/src/hooks/useGetAllNewsItems.ts": "Custom hook that fetches all news items from the backend, enabled when the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current authenticated user's profile, with loading state management and retry disabled.",
  "frontend/src/hooks/useGetGalleryItems.ts": "Custom hook that fetches all gallery items from the backend, enabled when the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Custom hook that provides a mutation for saving the current user's profile, invalidating the user profile query cache on success.",
  "frontend/src/hooks/useSubmitAdmissionForm.ts": "Custom hook that provides a mutation for submitting admission forms with candidate details and optional photo.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm traditional color palette (saffron, deep red, gold) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for managing admission applications, photo gallery, and news updates.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Page component with a form for submitting admission applications including personal details and photo upload, showing a success screen after submission.",
  "frontend/src/pages/HomePage.tsx": "Home page component with hero section displaying organization logo/name, call-to-action buttons for admission and scrolling to news, and sections for gallery and news content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations (accordion, fade-in), warm shadow variants, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document defining the Karani Sena Yuva Shakti website architecture with Internet Identity authentication, admission forms, admin panel for managing submissions/gallery/news, and image requirements for logo and hero background."
}