{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement public admission form with father's name field, unique ID generation, and printable admission card",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Add Father's Name field to admission form after Full Name field with required validation",
      "acceptanceCriteria": [
        "The admission form displays a 'Father's Name' input field after the 'Full Name' field",
        "The father's name field is required and validated before form submission",
        "The father's name value is included in the submission payload sent to the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdmissionFormPage.tsx",
          "operation": "modify",
          "description": "Add a 'fatherName' text input field immediately after the 'fullName' field in the form. Include required validation that prevents form submission if the field is empty. Update the form state and submission payload to include the fatherName value when calling the backend submitAdmissionForm function."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Create printable admission card component displaying candidate details and unique ID after successful submission",
      "acceptanceCriteria": [
        "After form submission, a printable admission card appears on screen",
        "The card displays the unique 10-character admission ID prominently",
        "The card includes all candidate details: full name, father's name, date of birth, mobile number, and uploaded photo",
        "The card layout is styled for printing with appropriate dimensions and formatting",
        "The card includes a print button that triggers the browser's print dialog"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdmissionCard.tsx",
          "operation": "create",
          "description": "Create a new component that renders a printable admission card. Display the unique admission ID (received from backend after submission), candidate's full name, father's name, date of birth, mobile number, uploaded photo (using ExternalBlob.getDirectURL()), and submission date. Style the card with a professional card-like layout optimized for printing (appropriate dimensions, borders, spacing). Include a print button that invokes window.print(). Use print-specific CSS media queries to hide the print button and optimize layout when printing."
        },
        {
          "path": "frontend/src/pages/AdmissionFormPage.tsx",
          "operation": "modify",
          "description": "Update the success state handling to capture and store the unique admission ID returned by the backend after form submission. Import and conditionally render the AdmissionCard component when the form submission is successful, passing all candidate details (including the unique ID, full name, father's name, date of birth, mobile number, photo) and submission timestamp to the card component. Replace or enhance the existing success message display to show the admission card instead."
        },
        {
          "path": "frontend/src/hooks/useSubmitAdmissionForm.ts",
          "operation": "modify",
          "description": "Update the mutation to return the unique admission ID from the backend response. Modify the return type and onSuccess callback to provide the generated admission ID to the calling component so it can be displayed in the admission card."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the submitAdmissionForm method signature to return Promise<string> instead of Promise<void>, reflecting that the backend now returns the generated unique admission ID. Note: This change aligns the type definition with the backend's new behavior of returning the admission ID."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Display unique admission ID in admin submissions list",
      "acceptanceCriteria": [
        "The admin submissions list displays the unique admission ID for each candidate",
        "The unique ID is prominently visible in the candidate details view",
        "Admins can easily identify and reference submissions by their unique ID"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminCandidatesList.tsx",
          "operation": "modify",
          "description": "Update the candidate display to show the unique admission ID (candidate.admissionID) prominently in the accordion list. Display the admission ID in the accordion trigger alongside the candidate's name, or as the first field in the candidate details section within each accordion item. Style the admission ID to make it stand out (e.g., bold text, distinct color, or badge styling) so admins can easily identify and reference submissions."
        }
      ]
    }
  ]
}