{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Karani Sena Yuva Shakti Organization Website - Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create home page with hero section displaying organization logo and name",
      "acceptanceCriteria": [
        "Hero section is prominently displayed at the top of the home page",
        "Organization logo is clearly visible in the hero section",
        "Organization name 'Karani Sena Yuva Shakti' is displayed alongside the logo"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "create",
          "description": "Create home page with hero section that displays the organization logo (frontend/public/assets/generated/ksys-logo.dim_400x400.png) and name 'Karani Sena Yuva Shakti' over a hero background (frontend/public/assets/generated/hero-bg.dim_1920x600.png). Include sections for news and gallery that will be populated by other requirements."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for HomePage at root path '/'. Set HomePage as the default landing page for the application."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement photo gallery section on home page displaying admin-uploaded photos",
      "acceptanceCriteria": [
        "Gallery displays all photos uploaded by admins",
        "Photos are arranged in a responsive grid or carousel layout",
        "Gallery is visually integrated into the home page design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GallerySection.tsx",
          "operation": "create",
          "description": "Create gallery section component that fetches and displays gallery items from backend using getGalleryItems(). Use the blob-storage component to display ExternalBlob images via getDirectURL() for optimal streaming and caching. Render photos in a responsive grid layout with descriptions."
        },
        {
          "path": "frontend/src/hooks/useGalleryItems.ts",
          "operation": "create",
          "description": "Create React Query hook to fetch gallery items from backend using getGalleryItems() method. Handle loading and error states appropriately."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Import and integrate GallerySection component into the home page below the hero section."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add organization news and messages section on home page displaying admin posts",
      "acceptanceCriteria": [
        "News section displays all published news posts",
        "Each news post shows title and content",
        "News posts are displayed in reverse chronological order (newest first)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NewsSection.tsx",
          "operation": "create",
          "description": "Create news section component that fetches and displays news items from backend using getAllNewsItems(). Display title, content, and formatted date for each post. Sort posts by createdAt in descending order (newest first)."
        },
        {
          "path": "frontend/src/hooks/useNewsItems.ts",
          "operation": "create",
          "description": "Create React Query hook to fetch news items from backend using getAllNewsItems() method. Handle loading and error states appropriately."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Import and integrate NewsSection component into the home page below the gallery section."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create admission form page with candidate information fields",
      "acceptanceCriteria": [
        "Form includes input fields for full name, complete address, email, date of birth, and mobile number",
        "All fields have appropriate input types (text, email, date, tel)",
        "Form has clear labels for each field",
        "Form includes a submit button"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdmissionFormPage.tsx",
          "operation": "create",
          "description": "Create admission form page with form fields for full name (text), complete address (textarea), email (email), date of birth (date), mobile number (tel), and last qualification (text). Include form validation and submit button. On successful submission, call backend submitAdmissionForm() method and show success feedback."
        },
        {
          "path": "frontend/src/hooks/useSubmitAdmissionForm.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to submit admission form data to backend using submitAdmissionForm() method. Handle success and error states, including photo upload if provided."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for AdmissionFormPage at path '/admission'. Add navigation link to admission form in main navigation."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add photo upload field to admission form for candidate photos",
      "acceptanceCriteria": [
        "Photo upload field accepts image files",
        "Upload field has clear instructions for candidates",
        "Preview of uploaded photo is shown before submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdmissionFormPage.tsx",
          "operation": "modify",
          "description": "Add photo upload input field with file type validation (accept image/*). Use the blob-storage component ExternalBlob.fromBytes() to convert uploaded file to ExternalBlob format. Implement preview functionality showing the selected image before submission. Include withUploadProgress() to display upload progress feedback to users."
        },
        {
          "path": "frontend/src/components/ImageUploadField.tsx",
          "operation": "create",
          "description": "Create reusable image upload component with drag-and-drop support, file validation, preview display, and upload progress indication using ExternalBlob.withUploadProgress(). Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create admin panel protected by Internet Identity authentication",
      "acceptanceCriteria": [
        "Admin panel is only accessible after Internet Identity authentication",
        "Unauthenticated users are redirected to login",
        "Admin panel has a logout option"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "create",
          "description": "Create admin panel page that uses the authorization component's authentication system. Check user authentication status using useInternetIdentity() hook and verify admin role using isCallerAdmin() backend method. Redirect unauthenticated users to login. Include logout functionality and serve as container for admin management sections. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProtectedRoute.tsx",
          "operation": "create",
          "description": "Create protected route wrapper component that uses the authorization component to guard admin-only routes. Check authentication status and admin role before rendering children. Show AccessDeniedScreen for unauthorized users."
        },
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Create access denied screen component to display when unauthorized users attempt to access admin-only pages. Include clear messaging and link to home page."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "create",
          "description": "Create profile setup modal that uses the authorization component to prompt new users for their name on first login. Use getCallerUserProfile() to check if profile exists and saveCallerUserProfile() to save new profile. Follow the component's pattern to prevent modal flash during actor initialization."
        },
        {
          "path": "frontend/src/hooks/useGetCallerUserProfile.ts",
          "operation": "create",
          "description": "Create React Query hook following the authorization component's pattern to fetch current user profile using getCallerUserProfile(). Properly handle actor dependency to prevent profile setup modal flash."
        },
        {
          "path": "frontend/src/hooks/useSaveCallerUserProfile.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to save user profile using saveCallerUserProfile() method from the authorization component."
        },
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "create",
          "description": "Create login/logout button component following the authorization component's pattern. Use useInternetIdentity() hook for authentication state and actions. Clear query cache on logout to remove cached application data."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for AdminPanel at path '/admin' wrapped with ProtectedRoute component. Add ProfileSetupModal to app root to handle new user onboarding. Add LoginButton to main navigation."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Implement admin functionality to view and manage admission form submissions",
      "acceptanceCriteria": [
        "Admin panel displays a list of all admission submissions",
        "Each submission shows candidate name, contact details, date of birth, and photo",
        "Admins can view full details of each submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminCandidatesList.tsx",
          "operation": "create",
          "description": "Create admin component to display all admission form submissions. Fetch candidates using getAllCandidates() backend method. Display candidate details including full name, address, email, date of birth, mobile, last qualification, and photo preview using ExternalBlob.getDirectURL(). Include expandable detail view for each submission."
        },
        {
          "path": "frontend/src/hooks/useGetAllCandidates.ts",
          "operation": "create",
          "description": "Create React Query hook to fetch all admission candidates from backend using getAllCandidates() method. Only enable when user is authenticated as admin."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Import and integrate AdminCandidatesList component into the admin panel as a tab or section."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add admin functionality to upload, view, and delete gallery photos",
      "acceptanceCriteria": [
        "Admin panel has an interface to upload new photos to the gallery",
        "Admin can view all uploaded gallery photos",
        "Admin can delete photos from the gallery",
        "Gallery photos are stored in the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGalleryManager.tsx",
          "operation": "create",
          "description": "Create admin component to manage gallery items. Display all gallery photos using getGalleryItems() with delete buttons. Include upload form using ImageUploadField component to add new photos with descriptions via addGalleryItem(). Use blob-storage component's ExternalBlob for image handling. Display images using getDirectURL() for optimal performance."
        },
        {
          "path": "frontend/src/hooks/useAddGalleryItem.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to add gallery items using addGalleryItem() backend method. Invalidate gallery query on success to refresh the list."
        },
        {
          "path": "frontend/src/hooks/useDeleteGalleryItem.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to delete gallery items using deleteGalleryItem() backend method. Invalidate gallery query on success to refresh the list."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Import and integrate AdminGalleryManager component into the admin panel as a tab or section."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement admin functionality to create, edit, and delete news posts",
      "acceptanceCriteria": [
        "Admin panel has a form to create new news posts with title and content",
        "Admin can edit existing news posts",
        "Admin can delete news posts",
        "News posts are stored in the backend and displayed on the home page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminNewsManager.tsx",
          "operation": "create",
          "description": "Create admin component to manage news items. Display all news posts using getAllNewsItems() with edit and delete buttons. Include form to create new posts using createNewsItem() and edit existing posts using editNewsItem(). Generate createdAt timestamps as bigint values."
        },
        {
          "path": "frontend/src/hooks/useCreateNewsItem.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to create news items using createNewsItem() backend method. Invalidate news query on success to refresh the list."
        },
        {
          "path": "frontend/src/hooks/useEditNewsItem.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to edit news items using editNewsItem() backend method. Invalidate news query on success to refresh the list."
        },
        {
          "path": "frontend/src/hooks/useDeleteNewsItem.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to delete news items using deleteNewsItem() backend method. Invalidate news query on success to refresh the list."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Import and integrate AdminNewsManager component into the admin panel as a tab or section."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Design website with cohesive theme using warm traditional colors and clean typography",
      "acceptanceCriteria": [
        "Color scheme uses warm, traditional tones that reflect organizational values",
        "Typography is readable and professional",
        "Layout is clean and organized across all pages",
        "Visual design is consistent throughout the application"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define global CSS custom properties for color scheme using saffron (#FF9933), deep red (#DC2626), and gold (#F59E0B) as primary colors. Set up warm accent colors and neutral backgrounds. Configure typography with clean, readable font families and appropriate sizing scales."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with custom colors matching the traditional color palette: saffron, deep red, and gold. Configure custom spacing, border radius, and shadow values to create a cohesive, culturally respectful design system."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "create",
          "description": "Create main layout component with consistent header, navigation, and footer. Apply theme colors and typography. Include organization branding and navigation links to home, admission form, and admin panel (when authenticated). Use warm color scheme throughout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap all routes with Layout component to ensure consistent design across all pages."
        }
      ]
    }
  ]
}